## Plan Result (sds_sbox)




<pre><code>Plan: 2 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_monitor_action_group.action_group
  * module.application_insights.azurerm_monitor_activity_log_alert.main
* Update
  * azurerm_resource_group.this
  * azurerm_service_plan.this
  * azurerm_storage_account.this
  * azurerm_user_assigned_identity.this
  * azurerm_windows_function_app.this
  * module.application_insights.azurerm_application_insights.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.this will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-alerts-slack-sbox"
        name     = "sds-alerts-slack-sbox"
      ~ tags     = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-alert-to-slack-function"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2024-03-07"
          - "startupMode"  = "always"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.this will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-alerts-slack-sbox/providers/Microsoft.Web/serverFarms/sds-alerts-slack-sbox"
        name                         = "sds-alerts-slack-sbox"
      ~ tags                         = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-alert-to-slack-function"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2024-03-07"
          - "startupMode"  = "always"
        } -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-alerts-slack-sbox/providers/Microsoft.Storage/storageAccounts/sdsalertsslacksbox"
        name                              = "sdsalertsslacksbox"
      ~ tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-alert-to-slack-function"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2024-03-07"
          - "startupMode"  = "always"
        } -> (known after apply)
        # (38 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_user_assigned_identity.this will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "this" {
        id                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-alerts-slack-sbox/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sds-alerts-slack-sbox"
        name                = "sds-alerts-slack-sbox"
      ~ tags                = {
          - "application"  = "core" -> null
          - "builtFrom"    = "hmcts/azure-alert-to-slack-function" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "sandbox" -> null
          - "expiresAfter" = "2024-03-07" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # azurerm_windows_function_app.this will be updated in-place
  ~ resource "azurerm_windows_function_app" "this" {
        id                                             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-alerts-slack-sbox/providers/Microsoft.Web/sites/sds-alerts-slack-sbox"
        name                                           = "sds-alerts-slack-sbox"
      ~ tags                                           = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-alert-to-slack-function"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2024-03-07"
          - "startupMode"  = "always"
        } -> (known after apply)
        # (27 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
      ~ daily_data_cap_notifications_disabled = false -> true
        id                                    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-alerts-slack-sbox/providers/Microsoft.Insights/components/sds-alerts-sbox"
        name                                  = "sds-alerts-sbox"
      ~ tags                                  = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-alert-to-slack-function"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2024-03-07"
          - "startupMode"  = "always"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_action_group.action_group will be created
  + resource "azurerm_monitor_action_group" "action_group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Sds-Alerts-Sbox-Warning-Alerts"
      + resource_group_name = "sds-alerts-slack-sbox"
      + short_name          = "sds-sbox"
      + tags                = (known after apply)

      + azure_function_receiver {
          + function_app_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-alerts-slack-sbox/providers/Microsoft.Web/sites/sds-alerts-slack-sbox"
          + function_name            = "httpTrigger"
          + http_trigger_url         = (sensitive value)
          + name                     = "slack-alerts"
          + use_common_alert_schema  = true
        }
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + name                = "Application Insights daily cap reached"
      + resource_group_name = "sds-alerts-slack-sbox"
      + scopes              = [
          + "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-alerts-slack-sbox/providers/Microsoft.Insights/components/sds-alerts-sbox",
        ]
      + tags                = (known after apply)

      + action {
          + action_group_id    = (known after apply)
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = ""
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-alerts-slack-sbox/providers/Microsoft.Insights/components/sds-alerts-sbox"
        }
    }

Plan: 2 to add, 6 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":18,"Program":"tfcmt","SHA1":"","Target":"sds_sbox","Vars":{}} -->